Revit 2027 API
CurtainGrid.NumPanels Property
 The number of panels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumPanels { get; }
Public ReadOnly Property NumPanels As Integer
	Get
public:
property int NumPanels {
	int get ();
}
member NumPanels : int with get
Property Value
Int32
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace